app/Controllers/Buku.php

    public function index()
    {
        $current=$this->request->getVar('page_buku')?? 1;
        $cari = $this->request->getVar('cari');

        if ($cari){
            $buku = $this->BukuModel->findBuku($cari);
            $pager = null;
        }else {
                $buku = $this->BukuModel->paginate(2, 'buku');
            }

        $data = [
            'title' => 'Daftar Buku',
            'buku' => $this->BukuModel->paginate(2, 'buku'),
---
SELECT *
FROM `buku`
 LIMIT 2, 2
SELECT COUNT(*) AS `numrows`
FROM `buku`