app/Models/BukuModel.php

    public function getBuku($idbuku = false) //fungsi untuk mencari id bukua = null engga
    {
        if ($idbuku == false) {
            return $this->findAll();
        }
        return $this->where(['id_buku' => $idbuku])->first();
---
SELECT *
FROM `buku`
WHERE `id_buku` = '10001'
 LIMIT 1